# GIT - это распределенная система контроля версий
# Это система для отслеживания и ведения истории изменения файлов в вашем проекте. При помощи распределенности git еще и организовывается командная работа.
# Репозиторий - это хранилище вашего кода и истории его изменений 
# GitHub - веб сайт для размещения git репозиториев в совместной разработке проектов
# Команды Git:
# 1. git init - создает новый локальный репозиторий , в той директории в которой была прописана команда (Команда вводиться один раз в начале)
# 2. git add - команда для добавления изминений в систему отслеживания git
# 3. git commit -m"<comment>" - это команда для сохранения всех изменений в локальном репозитории с комментариями к ним
# 4. git remote add <origin> <url> - это команда для того чтобы связать ваш локальный репо с удаленным в гитхабе
# 5. git push <origin> <main> - команда отправки всех ваших изменений на удаленный репозиторий 